bench_results/run_20260720_212829.log
[INFO] Base URL: http://127.0.0.1:8080
[INFO] Lua script: scripts/wrk_mixed.lua
[INFO] CSV output: bench_results/summary_20260720_212829.csv
[INFO] Log output: bench_results/run_20260720_212829.log

[STEP] Warmup
[INFO] warmup: c=50 t=8 d=10s
Running 10s test @ http://127.0.0.1:8080
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   149.99ms  106.40ms 426.83ms   56.13%
    Req/Sec    40.74     21.19   130.00     68.32%
  Latency Distribution
     50%  166.72ms
     75%  233.29ms
     90%  275.24ms
     99%  377.79ms
  3235 requests in 10.10s, 472.68KB read
  Non-2xx or 3xx responses: 45
Requests/sec:    320.35
Transfer/sec:     46.81KB

[STEP] Staircase benchmark
[INFO] staircase: c=50 t=8 d=30s
Running 30s test @ http://127.0.0.1:8080
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   128.34ms   82.58ms 439.11ms   57.99%
    Req/Sec    47.28     19.79   121.00     70.94%
  Latency Distribution
     50%  134.38ms
     75%  196.52ms
     90%  232.27ms
     99%  317.06ms
  11296 requests in 30.11s, 1.62MB read
Requests/sec:    375.17
Transfer/sec:     54.99KB

[INFO] staircase: c=100 t=8 d=30s
Running 30s test @ http://127.0.0.1:8080
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   283.91ms  201.46ms   1.73s    71.61%
    Req/Sec    46.90     21.89   150.00     69.51%
  Latency Distribution
     50%  272.46ms
     75%  412.51ms
     90%  488.03ms
     99%  991.77ms
  10591 requests in 30.11s, 1.47MB read
  Non-2xx or 3xx responses: 758
Requests/sec:    351.78
Transfer/sec:     49.98KB

[INFO] staircase: c=200 t=8 d=30s
Running 30s test @ http://127.0.0.1:8080
  8 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   432.66ms  358.26ms   1.05s    45.34%
    Req/Sec    61.02     38.55   287.00     70.00%
  Latency Distribution
     50%  483.33ms
     75%  737.54ms
     90%  939.56ms
     99%    1.01s 
  14429 requests in 30.10s, 1.81MB read
  Non-2xx or 3xx responses: 4858
Requests/sec:    479.34
Transfer/sec:     61.44KB

[INFO] staircase: c=400 t=8 d=30s
Running 30s test @ http://127.0.0.1:8080
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   357.55ms  359.22ms   1.47s    79.12%
    Req/Sec   190.43    131.23     0.87k    62.53%
  Latency Distribution
     50%  192.96ms
     75%  574.32ms
     90%    1.00s 
     99%    1.24s 
  44445 requests in 30.12s, 4.17MB read
  Non-2xx or 3xx responses: 41732
Requests/sec:   1475.53
Transfer/sec:    141.80KB

[INFO] staircase: c=800 t=8 d=30s
Running 30s test @ http://127.0.0.1:8080
  8 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   485.13ms  435.56ms   1.86s    68.28%
    Req/Sec   227.20    129.88     0.97k    75.16%
  Latency Distribution
     50%  327.51ms
     75%  778.54ms
     90%    1.19s 
     99%    1.57s 
  53844 requests in 30.09s, 5.05MB read
  Non-2xx or 3xx responses: 50861
Requests/sec:   1789.60
Transfer/sec:    172.02KB

[DONE] Benchmark finished.
[DONE] CSV: bench_results/summary_20260720_212829.csv
[DONE] LOG: bench_results/run_20260720_212829.log