bench_results/run_20260721_004620.log
[INFO] Base URL: http://127.0.0.1:8080
[INFO] Lua script: scripts/wrk_mixed.lua
[INFO] CSV output: bench_results/summary_20260721_004620.csv
[INFO] Log output: bench_results/run_20260721_004620.log

[STEP] Warmup
[INFO] warmup: c=50 t=8 d=10s
Running 10s test @ http://127.0.0.1:8080
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec     0.00      0.00     0.00      -nan%
  Latency Distribution
     50%    0.00us
     75%    0.00us
     90%    0.00us
     99%    0.00us
  0 requests in 10.10s, 0.00B read
  Socket errors: connect 0, read 48, write 380346, timeout 0
Requests/sec:      0.00
Transfer/sec:       0.00B

[STEP] Staircase benchmark
[INFO] staircase: c=50 t=8 d=30s