bench_results/run_20260721_030630.log
[INFO] Base URL: http://127.0.0.1:8080
[INFO] Lua script: scripts/wrk_mixed.lua
[INFO] CSV output: bench_results/summary_20260721_030630.csv
[INFO] Log output: bench_results/run_20260721_030630.log

[STEP] Warmup
[INFO] warmup: c=50 t=8 d=10s
Running 10s test @ http://127.0.0.1:8080
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    53.25ms   19.52ms 148.65ms   71.13%
    Req/Sec   109.52     30.58   207.00     77.22%
  Latency Distribution
     50%   50.32ms
     75%   63.72ms
     90%   78.38ms
     99%  113.62ms
  2875 requests in 10.09s, 435.50KB read
  Socket errors: connect 0, read 48, write 30754, timeout 0
Requests/sec:    284.99
Transfer/sec:     43.17KB

[STEP] Staircase benchmark
[INFO] staircase: c=50 t=8 d=30s